In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame, Series

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one -1.661856  1.069069
1    a  two  1.925251  1.039451
2    b  one -1.404621 -2.226190
3    b  two  1.061139 -0.693726
4    a  one -1.299760  1.102409

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a   -0.345455
b   -0.171741
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -1.480808
      two     1.925251
b     one    -1.404621
      two     1.061139
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -1.480808  1.925251
b    -1.404621  1.061139

In [10]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [11]:
years = np.array([2205, 2005, 2006, 2005 , 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005    1.925251
            2006   -1.404621
Ohio        2005    1.061139
            2006   -1.299760
            2205   -1.661856
Name: data1, dtype: float64

In [13]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.345455  1.070309
b    -0.171741 -1.459958

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.480808  1.085739
     two   1.925251  1.039451
b    one  -1.404621 -2.226190
     two   1.061139 -0.693726

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [16]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.661856  1.069069
1    a  two  1.925251  1.039451
4    a  one -1.299760  1.102409
b
  key1 key2     data1     data2
2    b  one -1.404621 -2.226190
3    b  two  1.061139 -0.693726

In [17]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -1.661856  1.069069
4    a  one -1.299760  1.102409
('a', 'two')
  key1 key2     data1     data2
1    a  two  1.925251  1.039451
('b', 'one')
  key1 key2     data1    data2
2    b  one -1.404621 -2.22619
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.061139 -0.693726

In [18]:
pieces = dict(list(df.groupby('key1')))

In [19]:
pieces['b']

  key1 key2     data1     data2
2    b  one -1.404621 -2.226190
3    b  two  1.061139 -0.693726

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

In [22]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.661856  1.069069
1  1.925251  1.039451
2 -1.404621 -2.226190
3  1.061139 -0.693726
4 -1.299760  1.102409
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [23]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   1.085739
     two   1.039451
b    one  -2.226190
     two  -0.693726

In [24]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [25]:
s_grouped

In [26]:
s_grouped.mean()

key1  key2
a     one     1.085739
      two     1.039451
b     one    -2.226190
      two    -0.693726
Name: data2, dtype: float64

In [27]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [28]:
people.iloc[2:3, [1, 2]] = np.nan # add a few NA values

In [29]:
people

               a         b         c         d         e
Joe     0.808073 -0.776179 -1.254724  1.144357 -0.961985
Steve  -1.468679  2.181378 -1.782193  1.167270  1.887960
Wes     0.442486       NaN       NaN -1.254087  0.364295
Jim    -0.883439  0.143535  1.378620 -0.026937 -0.401208
Travis -1.446733 -0.543753  0.112644 -0.896243  0.933029

In [30]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [31]:
by_column = people.groupby(mapping, axis=1)

In [32]:
by_column.sum()

            blue       red
Joe    -0.110367 -0.930090
Steve  -0.614923  2.600659
Wes    -1.254087  0.806781
Jim     1.351683 -1.141113
Travis -0.783599 -1.057458

In [33]:
map_series = pd.Series(mapping)

In [34]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [35]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [36]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.367120 -0.632643  0.123895 -0.136667 -0.998898
5 -1.468679  2.181378 -1.782193  1.167270  1.887960
6 -1.446733 -0.543753  0.112644 -0.896243  0.933029

In [37]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [38]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.442486 -0.776179 -1.254724 -1.254087 -0.961985
  two -0.883439  0.143535  1.378620 -0.026937 -0.401208
5 one -1.468679  2.181378 -1.782193  1.167270  1.887960
6 two -1.446733 -0.543753  0.112644 -0.896243  0.933029

In [39]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [40]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [41]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.191186 -0.467075 -0.937975 -0.086283  0.524161
1      1.268042  1.222082  0.062969  0.868648  2.457288
2      0.095244  1.022592 -0.561388 -0.980558  0.432588
3      0.253459 -0.317486  1.572280  0.160443 -0.544760

In [42]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3